PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_cgu.h
/****************************************************************************************************
 * arch/arm/src/lpc43xx/chip/lpc43_cgu.h
 *
 *   Copyright (C) 2012 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_CGU_H
#define __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_CGU_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/
/* Register Offsets *********************************************************************************/

#define LPC43_FREQ_MON_OFFSET           0x0014  /* Frequency monitor register */
#define LPC43_XTAL_OSC_CTRL_OFFSET      0x0018  /* Crystal oscillator control register */
#define LPC43_PLL0USB_STAT_OFFSET       0x001c  /* PLL0USB status register */
#define LPC43_PLL0USB_CTRL_OFFSET       0x0020  /* PLL0USB control register */
#define LPC43_PLL0USB_MDIV_OFFSET       0x0024  /* PLL0USB M-divider register */
#define LPC43_PLL0USB_NP_DIV_OFFSET     0x0028  /* PLL0USB N/P-divider register */
#define LPC43_PLL0AUDIO_STAT_OFFSET     0x002c  /* PLL0AUDIO status register */
#define LPC43_PLL0AUDIO_CTRL_OFFSET     0x0030  /* PLL0AUDIO control register */
#define LPC43_PLL0AUDIO_MDIV_OFFSET     0x0034  /* PLL0AUDIO M-divider */
#define LPC43_PLL0AUDIO_NP_DIV_OFFSET   0x0038  /* PLL0AUDIO N/P-divider */
#define LPC43_PLL0AUDIO_FRAC_OFFSET     0x003c  /* PLL0AUDIO fractional */
#define LPC43_PLL1_STAT_OFFSET          0x0040  /* PLL1 status register */
#define LPC43_PLL1_CTRL_OFFSET          0x0044  /* PLL1 control register */
#define LPC43_IDIVA_CTRL_OFFSET         0x0048  /* Integer divider A control register */
#define LPC43_IDIVB_CTRL_OFFSET         0x004c  /* Integer divider B control register */
#define LPC43_IDIVC_CTRL_OFFSET         0x0050  /* Integer divider C control register */
#define LPC43_IDIVD_CTRL_OFFSET         0x0054  /* Integer divider D control register */
#define LPC43_IDIVE_CTRL_OFFSET         0x0058  /* Integer divider E control register */
#define LPC43_BASE_SAFE_CLK_OFFSET      0x005c  /* Output stage 0 control register (BASE_SAFE_CLK) */
#define LPC43_BASE_USB0_CLK_OFFSET      0x0060  /* Output stage 1 control register (BASE_USB0_CLK) */
#define LPC43_BASE_PERIPH_CLK_OFFSET    0x0064  /* Output stage 2 control register (BASE_PERIPH_CLK) */
#define LPC43_BASE_USB1_CLK_OFFSET      0x0068  /* Output stage 3 control register (BASE_USB1_CLK) */
#define LPC43_BASE_M4_CLK_OFFSET        0x006c  /* Output stage 4 control register (BASE_M4_CLK) */
#define LPC43_BASE_SPIFI_CLK_OFFSET     0x0070  /* Output stage 5 control register (BASE_SPIFI_CLK) */
#define LPC43_BASE_SPI_CLK_OFFSET       0x0074  /* Output stage 6 control register (BASE_SPI_CLK) */
#define LPC43_BASE_PHYRX_CLK_OFFSET     0x0078  /* Output stage 7 control register (BASE_PHY_RX_CLK) */
#define LPC43_BASE_PHYTX_CLK_OFFSET     0x007c  /* Output stage 8 control register (BASE_PHY_TX_CLK) */
#define LPC43_BASE_APB1_CLK_OFFSET      0x0080  /* Output stage 9 control register (BASE_APB1_CLK) */
#define LPC43_BASE_APB3_CLK_OFFSET      0x0084  /* Output stage 10 control register (BASE_APB3_CLK) */
#define LPC43_BASE_LCD_CLK_OFFSET       0x0088  /* Output stage 11 control register (BASE_LCD_CLK) */
#define LPC43_BASE_VADC_CLK_OFFSET      0x008c  /* Output stage 12 control register (BASE_VADC_CLK) */
#define LPC43_BASE_SDIO_CLK_OFFSET      0x0090  /* Output stage 13 control register (BASE_SDIO_CLK) */
#define LPC43_BASE_SSP0_CLK_OFFSET      0x0094  /* Output stage 14 control register (BASE_SSP0_CLK) */
#define LPC43_BASE_SSP1_CLK_OFFSET      0x0098  /* Output stage 15 control register (BASE_SSP1_CLK) */
#define LPC43_BASE_USART0_CLK_OFFSET    0x009c  /* Output stage 16 control register (BASE_USART0_CLK) */
#define LPC43_BASE_UART1_CLK_OFFSET     0x00a0  /* Output stage 17 control register (BASE_UART1_CLK) */
#define LPC43_BASE_USART2_CLK_OFFSET    0x00a4  /* Output stage 18 control register (BASE_USART2_CLK) */
#define LPC43_BASE_USART3_CLK_OFFSET    0x00a8  /* Output stage 19 control register (BASE_USART3_CLK) */
#define LPC43_BASE_OUT_CLK_OFFSET       0x00ac  /* Output stage 20 control register (BASE_OUT_CLK) */
#define LPC43_BASE_APLL_CLK_OFFSET      0x00c0  /* Output stage 25 control register (BASE_APLL_CLK) */
#define LPC43_BASE_CGU_OUT0_CLK_OFFSET  0x00c4  /* Output stage 26 control register (BASE_CGU_OUT0_CLK) */
#define LPC43_BASE_CGU_OUT1_CLK_OFFSET  0x00c8  /* Output stage 27 control register (BASE_CGU_OUT1_CLK) */

/* Register Addresses *******************************************************************************/

#define LPC43_FREQ_MON                  (LPC43_CGU_BASE+LPC43_FREQ_MON_OFFSET)
#define LPC43_XTAL_OSC_CTRL             (LPC43_CGU_BASE+LPC43_XTAL_OSC_CTRL_OFFSET)
#define LPC43_PLL0USB_STAT              (LPC43_CGU_BASE+LPC43_PLL0USB_STAT_OFFSET)
#define LPC43_PLL0USB_CTRL              (LPC43_CGU_BASE+LPC43_PLL0USB_CTRL_OFFSET)
#define LPC43_PLL0USB_MDIV              (LPC43_CGU_BASE+LPC43_PLL0USB_MDIV_OFFSET)
#define LPC43_PLL0USB_NP_DIV            (LPC43_CGU_BASE+LPC43_PLL0USB_NP_DIV_OFFSET)
#define LPC43_PLL0AUDIO_STAT            (LPC43_CGU_BASE+LPC43_PLL0AUDIO_STAT_OFFSET)
#define LPC43_PLL0AUDIO_CTRL            (LPC43_CGU_BASE+LPC43_PLL0AUDIO_CTRL_OFFSET)
#define LPC43_PLL0AUDIO_MDIV            (LPC43_CGU_BASE+LPC43_PLL0AUDIO_MDIV_OFFSET)
#define LPC43_PLL0AUDIO_NP_DIV          (LPC43_CGU_BASE+LPC43_PLL0AUDIO_NP_DIV_OFFSET)
#define LPC43_PLL0AUDIO_FRAC            (LPC43_CGU_BASE+LPC43_PLL0AUDIO_FRAC_OFFSET)
#define LPC43_PLL1_STAT                 (LPC43_CGU_BASE+LPC43_PLL1_STAT_OFFSET)
#define LPC43_PLL1_CTRL                 (LPC43_CGU_BASE+LPC43_PLL1_CTRL_OFFSET)
#define LPC43_IDIVA_CTRL                (LPC43_CGU_BASE+LPC43_IDIVA_CTRL_OFFSET)
#define LPC43_IDIVB_CTRL                (LPC43_CGU_BASE+LPC43_IDIVB_CTRL_OFFSET)
#define LPC43_IDIVC_CTRL                (LPC43_CGU_BASE+LPC43_IDIVC_CTRL_OFFSET)
#define LPC43_IDIVD_CTRL                (LPC43_CGU_BASE+LPC43_IDIVD_CTRL_OFFSET)
#define LPC43_IDIVE_CTRL                (LPC43_CGU_BASE+LPC43_IDIVE_CTRL_OFFSET)
#define LPC43_BASE_SAFE_CLK             (LPC43_CGU_BASE+LPC43_BASE_SAFE_CLK_OFFSET)
#define LPC43_BASE_USB0_CLK             (LPC43_CGU_BASE+LPC43_BASE_USB0_CLK_OFFSET)
#define LPC43_BASE_PERIPH_CLK           (LPC43_CGU_BASE+LPC43_BASE_PERIPH_CLK_OFFSET)
#define LPC43_BASE_USB1_CLK             (LPC43_CGU_BASE+LPC43_BASE_USB1_CLK_OFFSET)
#define LPC43_BASE_M4_CLK               (LPC43_CGU_BASE+LPC43_BASE_M4_CLK_OFFSET)
#define LPC43_BASE_SPIFI_CLK            (LPC43_CGU_BASE+LPC43_BASE_SPIFI_CLK_OFFSET)
#define LPC43_BASE_SPI_CLK              (LPC43_CGU_BASE+LPC43_BASE_SPI_CLK_OFFSET)
#define LPC43_BASE_PHYRX_CLK            (LPC43_CGU_BASE+LPC43_BASE_PHYRX_CLK_OFFSET)
#define LPC43_BASE_PHYTX_CLK            (LPC43_CGU_BASE+LPC43_BASE_PHYTX_CLK_OFFSET)
#define LPC43_BASE_APB1_CLK             (LPC43_CGU_BASE+LPC43_BASE_APB1_CLK_OFFSET)
#define LPC43_BASE_APB3_CLK             (LPC43_CGU_BASE+LPC43_BASE_APB3_CLK_OFFSET)
#define LPC43_BASE_LCD_CLK              (LPC43_CGU_BASE+LPC43_BASE_LCD_CLK_OFFSET)
#define LPC43_BASE_VADC_CLK             (LPC43_CGU_BASE+LPC43_BASE_VADC_CLK_OFFSET)
#define LPC43_BASE_SDIO_CLK             (LPC43_CGU_BASE+LPC43_BASE_SDIO_CLK_OFFSET)
#define LPC43_BASE_SSP0_CLK             (LPC43_CGU_BASE+LPC43_BASE_SSP0_CLK_OFFSET)
#define LPC43_BASE_SSP1_CLK             (LPC43_CGU_BASE+LPC43_BASE_SSP1_CLK_OFFSET)
#define LPC43_BASE_USART0_CLK           (LPC43_CGU_BASE+LPC43_BASE_USART0_CLK_OFFSET)
#define LPC43_BASE_UART1_CLK            (LPC43_CGU_BASE+LPC43_BASE_UART1_CLK_OFFSET)
#define LPC43_BASE_USART2_CLK           (LPC43_CGU_BASE+LPC43_BASE_USART2_CLK_OFFSET)
#define LPC43_BASE_USART3_CLK           (LPC43_CGU_BASE+LPC43_BASE_USART3_CLK_OFFSET)
#define LPC43_BASE_OUT_CLK              (LPC43_CGU_BASE+LPC43_BASE_OUT_CLK_OFFSET)
#define LPC43_BASE_APLL_CLK             (LPC43_CGU_BASE+LPC43_BASE_APLL_CLK_OFFSET)
#define LPC43_BASE_CGU_OUT0_CLK         (LPC43_CGU_BASE+LPC43_BASE_CGU_OUT0_CLK_OFFSET)
#define LPC43_BASE_CGU_OUT1_CLK         (LPC43_CGU_BASE+LPC43_BASE_CGU_OUT1_CLK_OFFSET)

/* Register Bit Definitions *************************************************************************/

