PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_cgu.h
/* Frequency monitor register */

#define FREQ_MON_RCNT_SHIFT             (0)       /* Bits 0-8: 9-bit reference clock-counter value */
#define FREQ_MON_RCNT_MASK              (0x1ff << FREQ_MON_RCNT_SHIFT)
#define FREQ_MON_FCNT_SHIFT             (9)       /* Bits 9-22: 14-bit selected clock-counter value */
#define FREQ_MON_FCNT_MASK              (0x3fff << FREQ_MON_FCNT_SHIFT)
#define FREQ_MON_MEAS                   (1 << 23) /* Bit 23: Measure frequency */
#define FREQ_MON_CLKSEL_SHIFT           (24)      /* Bits 24-28: Clock-source selection */
#define FREQ_MON_CLKSEL_MASK            (31 << FREQ_MON_CLKSEL_SHIFT)
#  define FREQ_MON_CLKSEL_32KHZOSC      (0 << FREQ_MON_CLKSEL_SHIFT)  /* 32 kHz oscillator (default) */
#  define FREQ_MON_CLKSEL_IRQ           (1 << FREQ_MON_CLKSEL_SHIFT)  /* IRC */
#  define FREQ_MON_CLKSEL_ENET_RXCLK    (2 << FREQ_MON_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define FREQ_MON_CLKSEL_ENET_TXCLK    (3 << FREQ_MON_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define FREQ_MON_CLKSEL_GPCLKIN       (4 << FREQ_MON_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define FREQ_MON_CLKSEL_XTAL          (6 << FREQ_MON_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define FREQ_MON_CLKSEL_PLL0USB       (7 << FREQ_MON_CLKSEL_SHIFT)  /* PLL0USB */
#  define FREQ_MON_CLKSEL_PLL0AUDIO     (8 << FREQ_MON_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define FREQ_MON_CLKSEL_PLL1          (9 << FREQ_MON_CLKSEL_SHIFT)  /* PLL1 */
#  define FREQ_MON_CLKSEL_IDIVA         (12 << FREQ_MON_CLKSEL_SHIFT) /* IDIVA */
#  define FREQ_MON_CLKSEL_IDIVB         (13 << FREQ_MON_CLKSEL_SHIFT) /* IDIVB */
#  define FREQ_MON_CLKSEL_IDIVC         (14 << FREQ_MON_CLKSEL_SHIFT) /* IDIVC */
#  define FREQ_MON_CLKSEL_IDIVD         (15 << FREQ_MON_CLKSEL_SHIFT) /* IDIVD */
#  define FREQ_MON_CLKSEL_IDIVE         (16 << FREQ_MON_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* Crystal oscillator control register */

#define XTAL_OSC_CTRL_ENABLE            (1 << 0)  /* Bit 0:  Oscillator-pad enable */
#define XTAL_OSC_CTRL_BYPASS            (1 << 1)  /* Bit 1:  Configure crystal or external-clock input */
#define XTAL_OSC_CTRL_HF                (1 << 2)  /* Bit 2:  Select frequency range */
                                                  /* Bits 3-31: Reserved */
/* PLL0USB status register */

#define PLL0USB_STAT_LOCK               (1 << 0)  /* Bit 0:  PLL0 lock indicator */
#define PLL0USB_STAT_FR                 (1 << 1)  /* Bit 1:  PLL0 free running indicator */
                                                  /* Bits 2-31: Reserved */
/* PLL0USB control register */

#define PLL0USB_CTRL_PD                 (1 << 0)  /* Bit 0:  PLL0 power down */
#define PLL0USB_CTRL_BYPASS             (1 << 1)  /* Bit 1:  Input clock bypass control */
#define PLL0USB_CTRL_DIRECTI            (1 << 2)  /* Bit 2:  PLL0 direct input */
#define PLL0USB_CTRL_DIRECTO            (1 << 3)  /* Bit 3:  PLL0 direct output */
#define PLL0USB_CTRL_CLKEN              (1 << 4)  /* Bit 4:  PLL0 clock enable */
                                                  /* Bit 5:  Reserved */
#define PLL0USB_CTRL_FRM                (1 << 6)  /* Bit 6:  Free running mode */
                                                  /* Bits 7-10: Reserved */
#define PLL0USB_CTRL_AUTOBLOCK          (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define PLL0USB_CTRL_CLKSEL_SHIFT       (24)      /* Bits 24-28: Clock source selection */
#define PLL0USB_CTRL_CLKSEL_MASK        (31 << PLL0USB_CTRL_CLKSEL_SHIFT)
#  define PLL0USB_CLKSEL_32KHZOSC       (0 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define PLL0USB_CLKSEL_IRC            (1 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define PLL0USB_CLKSEL_ENET_RXCLK     (2 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define PLL0USB_CLKSEL_ENET_TXCLK     (3 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define PLL0USB_CLKSEL_GPCLKIN        (4 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define PLL0USB_CLKSEL_XTAL           (6 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define PLL0USB_CLKSEL_PLL1           (9 << PLL0USB_CTRL_CLKSEL_SHIFT)  /* PLL1 */
#  define PLL0USB_CLKSEL_IDIVA          (12 << PLL0USB_CTRL_CLKSEL_SHIFT) /* IDIVA */
#  define PLL0USB_CLKSEL_IDIVB          (13 << PLL0USB_CTRL_CLKSEL_SHIFT) /* IDIVB */
#  define PLL0USB_CLKSEL_IDIVC          (14 << PLL0USB_CTRL_CLKSEL_SHIFT) /* IDIVC */
#  define PLL0USB_CLKSEL_IDIVD          (15 << PLL0USB_CTRL_CLKSEL_SHIFT) /* IDIVD */
#  define PLL0USB_CLKSEL_IDIVE          (16 << PLL0USB_CTRL_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* PLL0USB M-divider register */

#define PLL0USB_MDIV_MDEC_SHIFT         (0)      /* Bits 0-16: Decoded M-divider coefficient value (1-131071) */
#define PLL0USB_MDIV_MDEC_MASK          (0x1ffff << PLL0USB_MDIV_MDEC_SHIFT)
#  define PLL0USB_MDIV_MDEC(n)          ((n) << PLL0USB_MDIV_MDEC_SHIFT)
#define PLL0USB_MDIV_SELP_SHIFT         (17)     /* Bits 17-21: Bandwidth select P value */
#define PLL0USB_MDIV_SELP_MASK          (0x1f << PLL0USB_MDIV_SELP_SHIFT)
#  define PLL0USB_MDIV_SELP(n)          ((n) << PLL0USB_MDIV_SELP_SHIFT)
#define PLL0USB_MDIV_SELI_SHIFT         (22)     /* Bits 22-27: Bandwidth select I value */
#define PLL0USB_MDIV_SELI_MASK          (0x3f << PLL0USB_MDIV_SELI_SHIFT)
#  define PLL0USB_MDIV_SELI(n)          ((n) << PLL0USB_MDIV_SELI_SHIFT)
#define PLL0USB_MDIV_SELR_SHIFT         (28)     /* Bits 28-31: Bandwidth select R value */
#define PLL0USB_MDIV_SELR_MASK          (15 << PLL0USB_MDIV_SELR_SHIFT)
#  define PLL0USB_MDIV_SELR(n)          ((n) << PLL0USB_MDIV_SELR_SHIFT)

/* PLL0USB N/P-divider register */

#define PLL0USB_NP_DIV_PDEC_SHIFT       (0)      /* Bits 0-6: Decoded P-divider coefficient value */
#define PLL0USB_NP_DIV_PDEC_MASK        (0x7f << PLL0USB_NP_DIV_PDEC_SHIFT)
#  define PLL0USB_NP_DIV_PDEC(n)        ((n) << PLL0USB_NP_DIV_PDEC_SHIFT)
                                                 /* Bits 7-11:  Reserved */
#define PLL0USB_NP_DIV_NDEC_SHIFT       (12)     /* Bits 12-21: Decoded N-divider coefficient value */
#define PLL0USB_NP_DIV_NDEC_MASK        (0x3ff << PLL0USB_NP_DIV_NDEC_SHIFT)
#  define PLL0USB_NP_DIV_NDEC(n)        ((n) << PLL0USB_NP_DIV_NDEC_SHIFT)
                                                 /* Bits 22-31:  Reserved */
/* PLL0AUDIO status register */

#define PLL0AUDIO_STAT_LOCK             (1 << 0)  /* Bit 0:  PLL0 lock indicator */
#define PLL0AUDIO_STAT_FR               (1 << 1)  /* Bit 1:  PLL0 free running indicator */
                                                  /* Bits 2-31: Reserved */
/* PLL0AUDIO control register */

#define PLL0AUDIO_CTRL_PD               (1 << 0)  /* Bit 0:  PLL0 power down */
#define PLL0AUDIO_CTRL_BYPASS           (1 << 1)  /* Bit 1:  Input clock bypass control */
#define PLL0AUDIO_CTRL_DIRECTI          (1 << 2)  /* Bit 2:  PLL0 direct input */
#define PLL0AUDIO_CTRL_DIRECTO          (1 << 3)  /* Bit 3:  PLL0 direct output */
#define PLL0AUDIO_CTRL_CLKEN            (1 << 4)  /* Bit 4:  PLL0 clock enable */
                                                  /* Bit 5:  Reserved */
#define PLL0AUDIO_CTRL_FRM              (1 << 6)  /* Bit 6:  Free running mode */
                                                  /* Bits 7-10: Reserved */
#define PLL0AUDIO_CTRL_AUTOBLOCK        (1 << 11) /* Bit 11: Block clock during frequency change */

#define PLL0AUDIO_CTRL_PLLFRACTREQ      (1 << 12) /* Bit 12: Fractional PLL word write request */
#define PLL0AUDIO_CTRL_SELEXT           (1 << 13) /* Bit 13: Select fractional divider */
#define PLL0AUDIO_CTRL_MODPD            (1 << 14) /* Bit 14: Sigma-Delta modulator power-down */
                                                  /* Bits 15-23: Reserved */
#define PLL0AUDIO_CTRL_CLKSEL_SHIFT     (24)      /* Bits 24-28: Clock source selection */
#define PLL0AUDIO_CTRL_CLKSEL_MASK      (31 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)
#  define PLL0AUDIO_CLKSEL_32KHZOSC     (0 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define PLL0AUDIO_CLKSEL_IRC          (1 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define PLL0AUDIO_CLKSEL_ENET_RXCLK   (2 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define PLL0AUDIO_CLKSEL_ENET_TXCLK   (3 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define PLL0AUDIO_CLKSEL_GPCLKIN      (4 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define PLL0AUDIO_CLKSEL_XTAL         (6 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define PLL0AUDIO_CLKSEL_PLL1         (9 << PLL0AUDIO_CTRL_CLKSEL_SHIFT)  /* PLL1 */
#  define PLL0AUDIO_CLKSEL_IDIVA        (12 << PLL0AUDIO_CTRL_CLKSEL_SHIFT) /* IDIVA */
#  define PLL0AUDIO_CLKSEL_IDIVB        (13 << PLL0AUDIO_CTRL_CLKSEL_SHIFT) /* IDIVB */
#  define PLL0AUDIO_CLKSEL_IDIVC        (14 << PLL0AUDIO_CTRL_CLKSEL_SHIFT) /* IDIVC */
#  define PLL0AUDIO_CLKSEL_IDIVD        (15 << PLL0AUDIO_CTRL_CLKSEL_SHIFT) /* IDIVD */
#  define PLL0AUDIO_CLKSEL_IDIVE        (16 << PLL0AUDIO_CTRL_CLKSEL_SHIFT) /* IDIVE */
                                                  /* Bits 29-31:  Reserved */
/* PLL0AUDIO M-divider */

