PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_cgu.h
#define PLL0AUDIO_MDIV_MDEC_SHIFT       (0)       /* Bits 0-16: Decoded M-divider coefficient value (1-131071) */
#define PLL0AUDIO_MDIV_MDEC_MASK        (0x1ffff << PLL0AUDIO_MDIV_MDEC_SHIFT)
#  define PLL0AUDIO_MDIV_MDEC(n)        ((n) << PLL0AUDIO_MDIV_MDEC_SHIFT)
                                                  /* Bits 17-31:  Reserved */
/* PLL0AUDIO N/P-divider */

#define PLL0AUDIO_NP_DIV_PDEC_SHIFT     (0)      /* Bits 0-6: Decoded P-divider coefficient value */
#define PLL0AUDIO_NP_DIV_PDEC_MASK      (0x7f << PLL0AUDIO_NP_DIV_PDEC_SHIFT)
#  define PLL0AUDIO_NP_DIV_PDEC(n)      ((n) << PLL0AUDIO_NP_DIV_PDEC_SHIFT)
                                                 /* Bits 7-11:  Reserved */
#define PLL0AUDIO_NP_DIV_NDEC_SHIFT     (12)     /* Bits 12-21: Decoded N-divider coefficient value */
#define PLL0AUDIO_NP_DIV_NDEC_MASK      (0x3ff << PLL0AUDIO_NP_DIV_NDEC_SHIFT)
#  define PLL0AUDIO_NP_DIV_NDEC(n)      ((n) << PLL0AUDIO_NP_DIV_NDEC_SHIFT)
                                                 /* Bits 22-31:  Reserved */
/* PLL0AUDIO fractional */

#define PLL0AUDIO_FRAC_CTRL_SHIFT       (0)      /* Bits 0-21: Decoded P-divider coefficient value */
#define PLL0AUDIO_FRAC_CTRL_MASK        (0x3fffff << PLL0AUDIO_FRAC_CTRL_SHIFT)
#  define PLL0AUDIO_FRA_CCTRL(n)        ((n) << PLL0AUDIO_FRAC_CTRL_SHIFT)
                                                 /* Bits 22-31:  Reserved */
/* PLL1 status register */

#define PLL1_STAT_LOCK                  (1 << 0)  /* Bit 0:  PLL1 lock indicator */
                                                  /* Bits 1-31: Reserved */
/* PLL1 control register */

#define PLL1_CTRL_PD                    (1 << 0)  /* Bit 0:  PLL1 power down */
#define PLL1_CTRL_BYPASS                (1 << 1)  /* Bit 1:  Input clock bypass control */
                                                  /* Bits 2-5: Reserved */
#define PLL1_CTRL_FBSEL                 (1 << 6)  /* Bit 6:  PLL1 feedback select */
#define PLL1_CTRL_DIRECT                (1 << 7)  /* Bit 7:  PLL1 direct CCO output */

#define PLL1_CTRL_PSEL_SHIFT            (8)       /* Bits 8-9: Post-divider division ratio P */
#define PLL1_CTRL_PSEL_MASK             (3 << PLL1_CTRL_PSEL_SHIFT)
#  define PLL1_CTRL_PSEL_DIV1           (0 << PLL1_CTRL_PSEL_SHIFT)
#  define PLL1_CTRL_PSEL_DIV2           (1 << PLL1_CTRL_PSEL_SHIFT)
#  define PLL1_CTRL_PSEL_DIV4           (2 << PLL1_CTRL_PSEL_SHIFT)
#  define PLL1_CTRL_PSEL_DIV8           (3 << PLL1_CTRL_PSEL_SHIFT)
                                                  /* Bit 10: Reserved */
#define PLL1_CTRL_AUTOBLOCK             (1 << 11) /* Bit 11: Block clock during frequency change */
#define PLL1_CTRL_NSEL_SHIFT            (12)      /* Bits 12-13: Pre-divider division ratio N */
#define PLL1_CTRL_NSEL_MASK             (3 << PLL1_CTRL_NSEL_SHIFT)
#  define PLL1_CTRL_NSEL_DIV1           (0 << PLL1_CTRL_NSEL_SHIFT)
#  define PLL1_CTRL_NSEL_DIV2           (1 << PLL1_CTRL_NSEL_SHIFT)
#  define PLL1_CTRL_NSEL_DIV3           (2 << PLL1_CTRL_NSEL_SHIFT)
#  define PLL1_CTRL_NSEL_DIV4           (3 << PLL1_CTRL_NSEL_SHIFT)
                                                  /* Bits 14-15: Reserved */
#define PLL1_CTRL_MSEL_SHIFT            (16)      /* Bits 16-17: Feedback-divider division ratio M */
#define PLL1_CTRL_MSEL_MASK             (3 << PLL1_CTRL_MSEL_SHIFT)
#  define PLL1_CTRL_MSEL(n)             (((n)-1) << PLL1_CTRL_MSEL_SHIFT) /* n=1..256 */
#define PLL1_CTRL_CLKSEL_SHIFT          (24)      /* Bits 24-28: Clock source selection */
#define PLL1_CTRL_CLKSEL_MASK           (31 << PLL1_CTRL_CLKSEL_SHIFT)
#  define PLL1_CLKSEL_32KHZOSC          (0 << PLL1_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define PLL1_CLKSEL_IRC               (1 << PLL1_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define PLL1_CLKSEL_ENET_RXCLK        (2 << PLL1_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define PLL1_CLKSEL_ENET_TXCLK        (3 << PLL1_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define PLL1_CLKSEL_GPCLKIN           (4 << PLL1_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define PLL1_CLKSEL_XTAL              (6 << PLL1_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define PLL1_CLKSEL_PLL0USB           (7 << PLL1_CTRL_CLKSEL_SHIFT)  /* PLL0USB */
#  define PLL1_CLKSEL_PLL0AUDIO         (8 << PLL1_CTRL_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define PLL1_CLKSEL_IDIVA             (12 << PLL1_CTRL_CLKSEL_SHIFT) /* IDIVA */
#  define PLL1_CLKSEL_IDIVB             (13 << PLL1_CTRL_CLKSEL_SHIFT) /* IDIVB */
#  define PLL1_CLKSEL_IDIVC             (14 << PLL1_CTRL_CLKSEL_SHIFT) /* IDIVC */
#  define PLL1_CLKSEL_IDIVD             (15 << PLL1_CTRL_CLKSEL_SHIFT) /* IDIVD */
#  define PLL1_CLKSEL_IDIVE             (16 << PLL1_CTRL_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* Integer divider A control register */

#define IDIVA_CTRL_PD                   (1 << 0)  /* Bit 0:  Integer divider A power down */
                                                  /* Bit 1:  Reserved */
#define IDIVA_CTRL_IDIV_SHIFT           (2)       /* Bits 2-3: Integer divider A divider values (1/(IDIV + 1)) */
#define IDIVA_CTRL_IDIV_MASK            (3 << IDIVA_CTRL_IDIV_SHIFT)
#  define IDIVA_CTRL_IDIV(n)            (((n)-1) << IDIVA_CTRL_IDIV_SHIFT) /* n=1..4 */
                                                  /* Bits 4-10: Reserved */
#define IDIVA_CTRL_AUTOBLOCK            (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define IDIVA_CTRL_CLKSEL_SHIFT         (24)      /* Bits 24-28: Clock source selection */
#define IDIVA_CTRL_CLKSEL_MASK          (31 << IDIVA_CTRL_CLKSEL_SHIFT)
#  define IDIVA_CLKSEL_32KHZOSC         (0 << IDIVA_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define IDIVA_CLKSEL_IRC              (1 << IDIVA_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define IDIVA_CLKSEL_ENET_RXCLK       (2 << IDIVA_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define IDIVA_CLKSEL_ENET_TXCLK       (3 << IDIVA_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define IDIVA_CLKSEL_GPCLKIN          (4 << IDIVA_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define IDIVA_CLKSEL_XTAL             (6 << IDIVA_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define IDIVA_CLKSEL_PLL0USB          (7 << IDIVA_CTRL_CLKSEL_SHIFT)  /* PLL0USB */
#  define IDIVA_CLKSEL_PLL0AUDIO        (8 << IDIVA_CTRL_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define IDIVA_CLKSEL_PLL1             (9 << IDIVA_CTRL_CLKSEL_SHIFT)  /* PLL1 */
                                                 /* Bits 29-31:  Reserved */
/* Integer divider B/C/D control register */

#define IDIVBCD_CTRL_PD                 (1 << 0)  /* Bit 0:  Integer divider power down */
                                                  /* Bit 1: Reserved */
#define IDIVBCD_CTRL_IDIV_SHIFT         (2)       /* Bits 2-5: Integer divider A divider values (1/(IDIV + 1)) */
#define IDIVBCD_CTRL_IDIV_MASK          (15 << IDIVBCD_CTRL_IDIV_SHIFT)
#  define IDIVBCD_CTRL_IDIV_DIV(n)      (((n)-1) << IDIVBCD_CTRL_IDIV_SHIFT) /* n=1..16 */
                                                  /* Bits 6-10: Reserved */
#define IDIVBCD_CTRL_AUTOBLOCK          (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define IDIVBCD_CTRL_CLKSEL_SHIFT       (24)      /* Bits 24-28: Clock source selection */
#define IDIVBCD_CTRL_CLKSEL_MASK        (31 << IDIVBCD_CTRL_CLKSEL_SHIFT)
#  define IDIVBCD_CLKSEL_32KHZOSC       (0 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define IDIVBCD_CLKSEL_IRC            (1 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define IDIVBCD_CLKSEL_ENET_RXCLK     (2 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define IDIVBCD_CLKSEL_ENET_TXCLK     (3 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define IDIVBCD_CLKSEL_GPCLKIN        (4 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define IDIVBCD_CLKSEL_XTAL           (6 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define IDIVBCD_CLKSEL_PLL0AUDIO      (8 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define IDIVBCD_CLKSEL_PLL1           (9 << IDIVBCD_CTRL_CLKSEL_SHIFT)  /* PLL1 */
#  define IDIVBCD_CLKSEL_IDIVA          (12 << IDIVBCD_CTRL_CLKSEL_SHIFT) /* IDIVA */
                                                 /* Bits 29-31:  Reserved */
/* Integer divider E control register */

