PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_cgu.h
#define IDIVE_CTRL_PD                   (1 << 0)  /* Bit 0:  Integer divider E power down */
                                                  /* Bit 1: Reserved */
#define IDIVE_CTRL_IDIV_SHIFT           (2)       /* Bits 2-9: Integer divider A divider values (1/(IDIV + 1)) */
#define IDIVE_CTRL_IDIV_MASK            (0xff << IDIVE_CTRL_IDIV_SHIFT)
#  define IDIVE_CTRL_IDIV_DIV(n)        (((n)-1) << IDIVE_CTRL_IDIV_SHIFT) /* n=1..256 */
                                                  /* Bit 10: Reserved */
#define IDIVE_CTRL_AUTOBLOCK            (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define IDIVE_CTRL_CLKSEL_SHIFT         (24)      /* Bits 24-28: Clock source selection */
#define IDIVE_CTRL_CLKSEL_MASK          (31 << IDIVE_CTRL_CLKSEL_SHIFT)
#  define IDIVE_CLKSEL_32KHZOSC         (0 << IDIVE_CTRL_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define IDIVE_CLKSEL_IRC              (1 << IDIVE_CTRL_CLKSEL_SHIFT)  /* IRC (default) */
#  define IDIVE_CLKSEL_ENET_RXCLK       (2 << IDIVE_CTRL_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define IDIVE_CLKSEL_ENET_TXCLK       (3 << IDIVE_CTRL_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define IDIVE_CLKSEL_GPCLKIN          (4 << IDIVE_CTRL_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define IDIVE_CLKSEL_XTAL             (6 << IDIVE_CTRL_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define IDIVE_CLKSEL_PLL0AUDIO        (8 << IDIVE_CTRL_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define IDIVE_CLKSEL_PLL1             (9 << IDIVE_CTRL_CLKSEL_SHIFT)  /* PLL1 */
#  define IDIVE_CLKSEL_IDIVA            (12 << IDIVE_CTRL_CLKSEL_SHIFT) /* IDIVA */
                                                 /* Bits 29-31:  Reserved */
/* Output stage 0 control register (BASE_SAFE_CLK) */

#define BASE_SAFE_CLK_PD                (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_SAFE_CLK_AUTOBLOCK         (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_SAFE_CLK_CLKSEL_SHIFT      (24)      /* Bits 24-28: Clock source selection */
#define BASE_SAFE_CLK_CLKSEL_MASK       (31 << BASE_SAFE_CLK_CLKSEL_SHIFT)
#  define BASE_SAFE_CLKSEL_IRC          (1 << BASE_SAFE_CLK_CLKSEL_SHIFT)  /* IRC (default) */
                                                 /* Bits 29-31:  Reserved */
/* Output stage 1 control register (BASE_USB0_CLK) */

#define BASE_USB0_CLK_PD                (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_USB0_CLK_AUTOBLOCK         (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_USB0_CLK_CLKSEL_SHIFT      (24)      /* Bits 24-28: Clock source selection */
#define BASE_USB0_CLK_CLKSEL_MASK       (31 << BASE_USB0_CLK_CLKSEL_SHIFT)
#  define BASE_USB0_CLKSEL_PLL0USB      (7 << BASE_USB0_CLK_CLKSEL_SHIFT)  /* PLL0USB (default) */
                                                  /* Bits 29-31:  Reserved */
/* Output stage 2 control register (BASE_PERIPH_CLK) */

#define BASE_PERIPH_CLK_PD              (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_PERIPH_CLK_AUTOBLOCK       (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_PERIPH_CLK_CLKSEL_SHIFT    (24)      /* Bits 24-28: Clock source selection */
#define BASE_PERIPH_CLK_CLKSEL_MASK     (31 << BASE_PERIPH_CLK_CLKSEL_SHIFT)
#  define BASE_PERIPH_CLKSEL_32KHZOSC   (0 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define BASE_PERIPH_CLKSEL_IRC        (1 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* IRC (default) */
#  define BASE_PERIPH_CLKSEL_ENET_RXCLK (2 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define BASE_PERIPH_CLKSEL_ENET_TXCLK (3 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define BASE_PERIPH_CLKSEL_GPCLKIN    (4 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define BASE_PERIPH_CLKSEL_XTAL       (6 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define BASE_PERIPH_CLKSEL_PLL0AUDIO  (8 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define BASE_PERIPH_CLKSEL_PLL1       (9 << BASE_PERIPH_CLK_CLKSEL_SHIFT)  /* PLL1 */
#  define BASE_PERIPH_CLKSEL_IDIVA      (12 << BASE_PERIPH_CLK_CLKSEL_SHIFT) /* IDIVA */
#  define BASE_PERIPH_CLKSEL_IDIVB      (13 << BASE_PERIPH_CLK_CLKSEL_SHIFT) /* IDIVB */
#  define BASE_PERIPH_CLKSEL_IDIVC      (14 << BASE_PERIPH_CLK_CLKSEL_SHIFT) /* IDIVC */
#  define BASE_PERIPH_CLKSEL_IDIVD      (15 << BASE_PERIPH_CLK_CLKSEL_SHIFT) /* IDIVD */
#  define BASE_PERIPH_CLKSEL_IDIVE      (16 << BASE_PERIPH_CLK_CLKSEL_SHIFT) /* IDIVE */
                                                  /* Bits 29-31:  Reserved */
/* Output stage 3 control register (BASE_USB1_CLK) */

#define BASE_USB1_CLK_PD                (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_USB1_CLK_AUTOBLOCK         (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_USB1_CLK_CLKSEL_SHIFT      (24)      /* Bits 24-28: Clock source selection */
#define BASE_USB1_CLK_CLKSEL_MASK       (31 << BASE_USB1_CLK_CLKSEL_SHIFT)
#  define BASE_USB1_CLKSEL_32KHZOSC     (0 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define BASE_USB1_CLKSEL_IRC          (1 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* IRC (default) */
#  define BASE_USB1_CLKSEL_ENET_RXCLK   (2 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define BASE_USB1_CLKSEL_ENET_TXCLK   (3 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define BASE_USB1_CLKSEL_GPCLKIN      (4 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define BASE_USB1_CLKSEL_XTAL         (6 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define BASE_USB1_CLKSEL_PLL0USB      (7 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* PLL0USB */
#  define BASE_USB1_CLKSEL_PLL0AUDIO    (8 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define BASE_USB1_CLKSEL_PLL1         (9 << BASE_USB1_CLK_CLKSEL_SHIFT)  /* PLL1 */
#  define BASE_USB1_CLKSEL_IDIVA        (12 << BASE_USB1_CLK_CLKSEL_SHIFT) /* IDIVA */
#  define BASE_USB1_CLKSEL_IDIVB        (13 << BASE_USB1_CLK_CLKSEL_SHIFT) /* IDIVB */
#  define BASE_USB1_CLKSEL_IDIVC        (14 << BASE_USB1_CLK_CLKSEL_SHIFT) /* IDIVC */
#  define BASE_USB1_CLKSEL_IDIVD        (15 << BASE_USB1_CLK_CLKSEL_SHIFT) /* IDIVD */
#  define BASE_USB1_CLKSEL_IDIVE        (16 << BASE_USB1_CLK_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* Output stage 4 control register (BASE_M4_CLK) */
/* NOTE: Clocks 4-19 are identical */

#define BASE_M4_CLK_PD                  (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_M4_CLK_AUTOBLOCK           (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_M4_CLK_CLKSEL_SHIFT        (24)      /* Bits 24-28: Clock source selection */
#define BASE_M4_CLK_CLKSEL_MASK         (31 << BASE_M4_CLK_CLKSEL_SHIFT)
#  define BASE_M4_CLKSEL_32KHZOSC       (0 << BASE_M4_CLK_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define BASE_M4_CLKSEL_IRC            (1 << BASE_M4_CLK_CLKSEL_SHIFT)  /* IRC (default) */
#  define BASE_M4_CLKSEL_ENET_RXCLK     (2 << BASE_M4_CLK_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define BASE_M4_CLKSEL_ENET_TXCLK     (3 << BASE_M4_CLK_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define BASE_M4_CLKSEL_GPCLKIN        (4 << BASE_M4_CLK_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define BASE_M4_CLKSEL_XTAL           (6 << BASE_M4_CLK_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define BASE_M4_CLKSEL_PLL0AUDIO      (8 << BASE_M4_CLK_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define BASE_M4_CLKSEL_PLL1           (9 << BASE_M4_CLK_CLKSEL_SHIFT)  /* PLL1 */
#  define BASE_M4_CLKSEL_IDIVA          (12 << BASE_M4_CLK_CLKSEL_SHIFT) /* IDIVA */
#  define BASE_M4_CLKSEL_IDIVB          (13 << BASE_M4_CLK_CLKSEL_SHIFT) /* IDIVB */
#  define BASE_M4_CLKSEL_IDIVC          (14 << BASE_M4_CLK_CLKSEL_SHIFT) /* IDIVC */
#  define BASE_M4_CLKSEL_IDIVD          (15 << BASE_M4_CLK_CLKSEL_SHIFT) /* IDIVD */
#  define BASE_M4_CLKSEL_IDIVE          (16 << BASE_M4_CLK_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* Output stage 5 control register (BASE_SPIFI_CLK) */
/* NOTE: Clocks 4-19 are identical */

#define BASE_SPIFI_CLK_PD               (1 << 0)  /* Bit 0:  Output stage power down */
                                                  /* Bits 1-10: Reserved */
#define BASE_SPIFI_CLK_AUTOBLOCK        (1 << 11) /* Bit 11: Block clock during frequency change */
                                                  /* Bits 12-23: Reserved */
#define BASE_SPIFI_CLK_CLKSEL_SHIFT     (24)      /* Bits 24-28: Clock source selection */
#define BASE_SPIFI_CLK_CLKSEL_MASK      (31 << BASE_SPIFI_CLK_CLKSEL_SHIFT)
#  define BASE_SPIFI_CLKSEL_32KHZOSC    (0 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* 32 kHz oscillator */
#  define BASE_SPIFI_CLKSEL_IRC         (1 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* IRC (default) */
#  define BASE_SPIFI_CLKSEL_ENET_RXCLK  (2 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* ENET_RX_CLK */
#  define BASE_SPIFI_CLKSEL_ENET_TXCLK  (3 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* ENET_TX_CLK */
#  define BASE_SPIFI_CLKSEL_GPCLKIN     (4 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* GP_CLKIN */
#  define BASE_SPIFI_CLKSEL_XTAL        (6 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* Crystal oscillator */
#  define BASE_SPIFI_CLKSEL_PLL0AUDIO   (8 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* PLL0AUDIO */
#  define BASE_SPIFI_CLKSEL_PLL1        (9 << BASE_SPIFI_CLK_CLKSEL_SHIFT)  /* PLL1 */
#  define BASE_SPIFI_CLKSEL_IDIVA       (12 << BASE_SPIFI_CLK_CLKSEL_SHIFT) /* IDIVA */
#  define BASE_SPIFI_CLKSEL_IDIVB       (13 << BASE_SPIFI_CLK_CLKSEL_SHIFT) /* IDIVB */
#  define BASE_SPIFI_CLKSEL_IDIVC       (14 << BASE_SPIFI_CLK_CLKSEL_SHIFT) /* IDIVC */
#  define BASE_SPIFI_CLKSEL_IDIVD       (15 << BASE_SPIFI_CLK_CLKSEL_SHIFT) /* IDIVD */
#  define BASE_SPIFI_CLKSEL_IDIVE       (16 << BASE_SPIFI_CLK_CLKSEL_SHIFT) /* IDIVE */
                                                 /* Bits 29-31:  Reserved */
/* Output stage 6 control register (BASE_SPI_CLK) */
/* NOTE: Clocks 4-19 are identical */

